sys/209.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">       
      <input>
            &lt;SYSMessage&gt;
            &lt;messageGuid value="<%=messageGuid %>" /&gt;
                        &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="209" value="Bebek / Cocuk Izlem Veri Seti" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                        &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                            &lt;/author&gt;
                        &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                            &lt;recordData>
                        &lt;BEBEK_COCUK_IZLEM_VERI_SETI&gt;
                                <%if(BAS_CEVRESI!=-1){ %>
                                    &lt;BAS_CEVRESI value="<%=BAS_CEVRESI %>" /&gt;
                            <%} %>
                            &lt;DEMIR_LOJISTIGI_VE_DESTEGI version="1" codeSystemGuid="83c966d5-1054-451c-87c6-19a0e11b287b" code="<%=DEMIR_LOJISTIGI_VE_DESTEGI.KODU %>" value="<%=DEMIR_LOJISTIGI_VE_DESTEGI.ADI %>" /&gt;
                            <%if(DOGUM_AGIRLIGI!=-1){ %>
                                &lt;DOGUM_AGIRLIGI value="<%=DOGUM_AGIRLIGI %>" /&gt;
                            <%} %>
                            &lt;D_VITAMINI_LOJISTIGI_VE_DESTEGI version="1" codeSystemGuid="672986f8-5e0d-43a6-b417-37bdc59cd09b" code="<%=D_VITAMINI_LOJISTIGI_VE_DESTEGI.KODU %>" value="<%=D_VITAMINI_LOJISTIGI_VE_DESTEGI.ADI %>" /&gt;
                                <%if(HEMATOKRIT!=-1){ %>
                                    &lt;HEMATOKRIT value="<%=HEMATOKRIT %>" /&gt;
                                <%} %>
                                <%if(HEMOGLOBIN!=-1){ %>
                                    &lt;HEMOGLOBIN value="<%=HEMOGLOBIN %>" /&gt;
                                <%} %>
                                &lt;KACINCI_IZLEM version="1" codeSystemGuid="402e5a45-f723-4309-9cb8-686358dee75a" code="<%=KACINCI_IZLEM.KODU %>" value="<%=KACINCI_IZLEM.ADI %>" /&gt;
                                <%if(GKD_TARAMA_SONUCU!=-1){ %>
                                    &lt;GKD_TARAMA_SONUCU version="1" codeSystemGuid="03dee8e4-6d54-4009-9b53-84c11d302e14" code="<%=GKD_TARAMA_SONUCU.KODU %>" value="<%=GKD_TARAMA_SONUCU.ADI %>" /&gt;
                                <%} %>
                                <%if(GORME_TARAMA_SONUCU!=-1){ %>
                                    &lt;GORME_TARAMA_SONUCU version="1" codeSystemGuid="bb174db7-75ea-4bd4-a3e9-cf2a908511cb" code="<%=GORME_TARAMA_SONUCU.KODU %>" value="<%=GORME_TARAMA_SONUCU.ADI %>" /&gt;
                            <%} %>
                            <%if(BEBEGIN_BESLENME_DURUMU!=-1){ %>
                                &lt;BEBEGIN_BESLENME_DURUMU version="1" codeSystemGuid="7f29ff54-3810-4875-9dda-01ac0d70fa21" code="<%=BEBEGIN_BESLENME_DURUMU.KODU %>" value="<%=BEBEGIN_BESLENME_DURUMU.ADI %>" /&gt;
                            <%} %>
                            <%if(NTP_TAKIP_BILGISI!=-1){ %>
                                &lt;NTP_TAKIP_BILGISI version="1" codeSystemGuid="b409d9c0-fe50-43e0-afab-889cf87a2855" code="<%=NTP_TAKIP_BILGISI.KODU %>" value="<%=NTP_TAKIP_BILGISI.ADI %>" /&gt;
                            <%} %>
                            &lt;IZLEM_ISLEM_TURU version="1" codeSystemGuid="5fff8778-89a4-4045-b33e-a7ffe0de0179" code="<%=IZLEM_ISLEM_TURU.KODU %>" value="<%=IZLEM_ISLEM_TURU.ADI %>" /&gt;
                                &lt;BOY_KILO_BILGILERI&gt;
                                    <%if(BOY!=-1){ %>
                                        &lt;BOY value="<%=BOY %>" /&gt;
                                <%} %>
                                <%if(KILO!=-1){ %>
                                    &lt;KILO value="<%=KILO %>" /&gt;
                                <%} %>
                                &lt;/BOY_KILO_BILGILERI&gt;
                            &lt;/BEBEK_COCUK_IZLEM_VERI_SETI&gt;
                        &lt;HASTA_TAKIP_BILGISI&gt;
                            &lt;SYSTakipNo value="<%=SYSTakipNo %>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                            </input>
                        </SYSSendMessage>
                        </s:Body>
                </s:Envelope>